app/controllers/api/images_controller.rb

INSERT INTO "images" ("url", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @image = Image.create(
      url: params[:url],
      product_id: params[:product_id],
    )

SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    @image = Image.find_by(id: params[:id])