app/controllers/api/orders_controller.rb

INSERT INTO "orders" ("user_id", "product_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["product_id", 4], ["quantity", 1], ["created_at", "2019-11-20 02:34:52.241418"], ["updated_at", "2019-11-20 02:34:52.241418"]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def create
    if current_user
      @order = Order.new(
        user_id: current_user.id,
        product_id: params[:product_id],
        quantity: params[:quantity],
      )
      if @order.save
        @product = Product.find_by(id: params[:product_id])