app/controllers/api/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
---
  def index
    @orders = Order.where(user_id: current_user.id)

SELECT "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."status" = $1 LIMIT $2  [["status", "Carted"], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "subtotal", "tax", "total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["subtotal", "149.99"], ["tax", "15.37"], ["total", "165.36"], ["created_at", "2019-11-24 17:32:59.194806"], ["updated_at", "2019-11-24 17:32:59.194806"]]
SELECT "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."status" = $1  [["status", "Carted"]]
UPDATE "orders" SET "subtotal" = $1, "tax" = $2, "total" = $3, "updated_at" = $4 WHERE "orders"."id" = $5  [["subtotal", "399.98"], ["tax", "41.0"], ["total", "420.98"], ["updated_at", "2019-11-20 03:02:24.802696"], ["id", 8]]
UPDATE "shopping_carts" SET "status" = $1, "order_id" = $2, "updated_at" = $3 WHERE "shopping_carts"."id" = $4  [["status", "Purchased"], ["order_id", 3], ["updated_at", "2019-11-24 17:38:50.615835"], ["id", 2]]
---
  def create
    shopping_cart = ShoppingCart.find_by(status: "Carted")
    quantity = shopping_cart.quantity
    product_id = shopping_cart.product_id

    product = Product.find_by(id: product_id.to_i)
    subtotal = quantity.to_i * product.price
    tax = quantity.to_i * product.tax
    total = quantity.to_i * product.total

    @order = Order.new(
      user_id: current_user.id,
      subtotal: subtotal,
      tax: tax,
      total: total,
    )
    if @order.save
      shopping_cart = ShoppingCart.find_by(status: "Carted")
      shopping_cart.status = "Purchased"
      shopping_cart.order_id = @order.id
      shopping_cart.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @order = Order.find_by(id: params[:id])