app/controllers/api/products_controller.rb

  def index
    @products = Product.all

    if params[:search]
      # @products = @products.find_by_name
      @products = @products.where("name ILIKE ?", "%#{params[:search]}%")
    end
    # commented out for compatibility with front end
    # if params[:q]
    #   @products = @products.where("name ILIKE ?", "%#{params[:q]}%")
    # end
    if params[:discount]
      @products = @products.where("on_sale = ?", params[:discount].to_s)
    end
    # commented out for compatibility with front end
    # if params[:sale]
    #   @products = @products.where("on_sale = ?", "#{params[:sale]}")
    # end

    if params[:category]
      category = Category.find_by(name: params[:category])
      @products = category.products
    end

    if params[:sort] == "price" && params[:sort_order] == "asc"
      @products = @products.order(price: :asc)
    elsif params[:sort] == "price" && params[:sort_order] == "desc"
      @products = @products.order(price: :desc)
    else
      @products = @products.order(id: :asc)
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "Tops"], ["LIMIT", 1]]
SELECT "products".* FROM "products" INNER JOIN "category_products" ON "products"."id" = "category_products"."product_id" WHERE "category_products"."category_id" = $1 ORDER BY "products"."price" DESC  [["category_id", 1]]
SELECT "products".* FROM "products" INNER JOIN "category_products" ON "products"."id" = "category_products"."product_id" WHERE "category_products"."category_id" = $1 ORDER BY "products"."id" ASC  [["category_id", 1]]

  def update
    @product = Product.find_by(id: params[:id])
    @product.name = params[:name] || @product.name
    @product.price = params[:price] || @product.price
    @product.currency_code = params[:currency_code] || @product.currency_code
    @product.stock = params[:stock] || @product.stock
    @product.description = params[:description] || @product.description
    @product.on_sale = params[:on_sale] || @product.on_sale
    @product.discount = params[:discount] || @product.discount
    @product.supplier_id = params[:supplier_id] || @product.supplier_id
    if @product.save
---
UPDATE "products" SET "price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["price", "199.98"], ["updated_at", "2019-11-21 01:33:09.872781"], ["id", 4]]