app/controllers/api/products_controller.rb

  def show
    products = Product.all
---
SELECT "products".* FROM "products"