app/controllers/api/products_controller.rb

  def create
    @product = Product.new(
      name: params[:name],
      price: params[:price],
      currency_code: params[:currency_code],
      stock: params[:stock],
      image_url: params[:image_url],
      description: params[:description],
      on_sale: params[:on_sale],
      discount: params[:discount],
    )
    if @product.save
---
INSERT INTO "products" ("name", "price", "currency_code", "stock", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @product = Product.find_by(id: params[:id])
    @product.name = params[:name] || @product.name
    @product.price = params[:price] || @product.price
    @product.currency_code = params[:currency_code] || @product.currency_code
    @product.stock = params[:stock] || @product.stock
    @product.image_url = params[:image_url] || @product.image_url
    @product.description = params[:description] || @product.description
    @product.on_sale = params[:on_sale] || @product.on_sale
    @product.discount = params[:discount] || @product.discount
    if @product.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "price" = $2, "stock" = $3, "image_url" = $4, "on_sale" = $5, "discount" = $6, "updated_at" = $7 WHERE "products"."id" = $8  [["name", "Bustle"], ["price", "34.99"], ["stock", 1], ["image_url", "www.google.com"], ["on_sale", false], ["discount", 0], ["updated_at", "2019-11-14 03:24:57.584693"], ["id", 1]]

  def destroy
    @product = Product.find_by(id: params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 4]]