app/controllers/api/shopping_carts_controller.rb

SELECT "shopping_carts".* FROM "shopping_carts" WHERE (status LIKE 'Carted')
---
  def index
    @shopping_carts = current_user.shopping_carts.where(status: "Carted")

INSERT INTO "shopping_carts" ("user_id", "product_id", "quantity", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["product_id", 1], ["quantity", 2], ["status", "Carted"], ["created_at", "2019-11-24 17:42:17.523595"], ["updated_at", "2019-11-24 17:42:17.523595"]]
---
  def create
    @shopping_cart = ShoppingCart.new(
      user_id: current_user.id,
      product_id: params[:product_id],
      quantity: params[:quantity],
      status: "Carted",
    )
    @shopping_cart.save

SELECT "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "shopping_carts" SET "status" = $1, "updated_at" = $2 WHERE "shopping_carts"."id" = $3  [["status", "Removed"], ["updated_at", "2019-11-24 17:49:52.823773"], ["id", 4]]
---
  def destroy
    @shopping_cart = current_user.shopping_carts.find_by(id: params[:id])
    @shopping_cart.status = "Removed"
    @shopping_cart.save