app/controllers/api/shopping_carts_controller.rb

SELECT "shopping_carts".* FROM "shopping_carts"
---
  def index
    @shopping_carts = ShoppingCart.all