app/controllers/api/suppliers_controller.rb

INSERT INTO "suppliers" ("name", "email", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Target"], ["email", "target@target.com"], ["phone_number", "333-333-3333"], ["created_at", "2019-11-15 16:34:53.121715"], ["updated_at", "2019-11-15 16:34:53.121715"]]
---
  def create
    @supplier = Supplier.create(
      name: params[:name],
      email: params[:email],
      phone_number: params[:phone_number],
    )

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @supplier = Supplier.find_by(id: params[:id])

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "suppliers" SET "email" = $1, "phone_number" = $2, "updated_at" = $3 WHERE "suppliers"."id" = $4  [["email", "cs@express.com"], ["phone_number", "101-101-1001"], ["updated_at", "2019-11-15 16:45:34.689811"], ["id", 1]]
---
  def update
    @supplier = Supplier.find_by(id: params[:id])
    @supplier.name = params[:name] || @supplier.name
    @supplier.email = params[:email] || @supplier.email
    @supplier.phone_number = params[:phone_number] || @supplier.phone_number
    @supplier.save

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "suppliers" WHERE "suppliers"."id" = $1  [["id", 3]]
---
  def destroy
    @supplier = Supplier.find_by(id: params[:id])
    @supplier.destroy