app/controllers/application_controller.rb

  def get_db_extract
    @db_extract = Product.all
---
SELECT "products".* FROM "products"