app/controllers/products_controller.rb

  def create
    if params[:on_sale] == "false"
      discount = false
    elsif params[:on_sale] == "true"
      discount = true
    end

    @product = Product.new(
      name: params[:name],
      price: params[:price],
      currency_code: params[:currency_code],
      stock: params[:stock],
      description: params[:description],
      discount: params[:discount],
      supplier_id: params[:supplier_id],
      on_sale: discount,
    )
    if @product.save
---
INSERT INTO "products" ("name", "price", "currency_code", "stock", "description", "on_sale", "created_at", "updated_at", "supplier_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    @product = Product.find_by(id: params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    if params[:on_sale] == "false"
      discount = false
    elsif params[:on_sale] == "true"
      discount = true
    end

    @product = Product.find_by(id: params[:id])
    @product.name = params[:name]
    @product.price = params[:price]
    @product.currency_code = params[:currency_code]
    @product.stock = params[:stock]
    @product.description = params[:description]
    @product.on_sale = discount
    @product.discount = params[:discount]
    @product.supplier_id = params[:supplier_id]
    if @product.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "on_sale" = $1, "discount" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["on_sale", true], ["discount", 10], ["updated_at", "2019-11-28 01:35:32.511616"], ["id", 14]]

  def destroy
    @product = Product.find_by(id: params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 14]]