app/models/order.rb

  def calculations
    cart_subtotal = 0
    cart_taxes = 0

    shopping_carts.each do |item|
      cart_subtotal += (item.product.price * item.quantity)
      cart_taxes += (item.product.tax * item.quantity)
    end

    cart_total = cart_subtotal + cart_taxes
    self.subtotal = cart_subtotal
    self.tax = cart_taxes
    self.total = cart_total
    self.save
---
UPDATE "orders" SET "subtotal" = $1, "tax" = $2, "total" = $3, "updated_at" = $4 WHERE "orders"."id" = $5  [["subtotal", "0.0"], ["tax", "0.0"], ["total", "0.0"], ["updated_at", "2019-11-26 15:37:19.511404"], ["id", 7]]